pkwdata/M4G-BLE-Bridge/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"

# CPU Configuration for better USB performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Bluetooth Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
CONFIG_BT_NIMBLE_NVS_PERSIST=y

# Disable advanced BLE features for Windows compatibility
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=n
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_2M_PHY=n
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_CODED_PHY=n
## Unknown kconfig symbol
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_CSA2=n
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_DATA_LEN_EXT=n
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_PING=n
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_SLAVE_INIT_FEAT_XCHG=n

# Security and Pairing Configuration for HID compatibility
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=n
CONFIG_BT_NIMBLE_DEBUG=n

# Additional BLE controller level compatibility settings
CONFIG_BT_CONTROLLER_ENABLED=y
## Unknown kconfig symbol
# CONFIG_BT_CONTROLLER_BLE_MAX_CONN=1
# CONFIG_BT_CONTROLLER_DIS_SCAN_BACKOFF=y

# Windows HID compatibility - force basic BLE mode
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=0
CONFIG_BT_NIMBLE_MAX_CCCDS=8

# Disable connection parameter requests that cause UNSUPP_REM_FEATURE
## Unknown kconfig symbol
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_CONN_PARAM_REQ=n

# Disable LE Privacy features that Windows might request
## Unknown kconfig symbol
# CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_PRIVACY=n
# CONFIG_BT_NIMBLE_PRIVACY=n

# USB Host Configuration
## Unknown kconfig symbol
# CONFIG_USB_HOST_ENABLE=y
# CONFIG_USB_HOST_HUB_ENABLE=y
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=512
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# USB Host Channel Configuration - use menuconfig values
# Note: USB channel count is typically hardware-limited on ESP32-S3
# The DWC2 controller has a fixed number of channels (usually 8 total)

# Optimize USB resource allocation instead
## Unknown kconfig symbol
# CONFIG_USB_HOST_PERIODIC_FRAME_LIST_SIZE=1024

# USB Hub Configuration (Critical for CharaChorder dual ESP32-S3 setup)
CONFIG_USB_HOST_HUB_MULTI_LEVEL=y
CONFIG_USB_HOST_HUBS_SUPPORTED=y
## Unknown kconfig symbol
# CONFIG_USB_HOST_HUB_ROOT_PORT_DEBOUNCE_DELAY_MS=1000
# CONFIG_USB_HOST_HUB_PORT_RECOVERY_DELAY_MS=100

# USB HID Host Configuration
## Unknown kconfig symbol
# CONFIG_USB_HOST_HID_ENABLE=y
# CONFIG_USB_HOST_HID_MAX_INTERFACES=4
# CONFIG_USB_HOST_HID_MAX_DEVICES=4

# USB Enumeration Timeouts (optimized for hub + dual devices)
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=1000
CONFIG_USB_HOST_RESET_HOLD_MS=50
CONFIG_USB_HOST_RESET_RECOVERY_MS=100
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10

# USB Physical Layer
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y

# CharaChorder detection defaults
CONFIG_M4G_USB_CHARACHORDER_VENDOR_ID=0x303A
CONFIG_M4G_USB_CHARACHORDER_PRODUCT_ID=0xFFFF

# CharaChorder-specific options
CONFIG_M4G_CHARACHORDER_DEBOUNCE_MS=5
# CharaChorder chord processing
CONFIG_M4G_CHARACHORDER_CHORD_TIMEOUT_MS=500
CONFIG_M4G_CHARACHORDER_CHORD_DELAY_MS=15
# CONFIG_M4G_CHARACHORDER_RAW_MODE is not set

# Mouse configuration (arrow keys -> mouse movement)
CONFIG_M4G_ENABLE_ARROW_MOUSE=n
CONFIG_M4G_MOUSE_BASE_SPEED=5
CONFIG_M4G_MOUSE_ENABLE_ACCELERATION=y
CONFIG_M4G_MOUSE_ACCEL_INCREMENT=3
CONFIG_M4G_MOUSE_ACCEL_INTERVAL_MS=100
CONFIG_M4G_MOUSE_MAX_SPEED=40

# Key repeat configuration
CONFIG_M4G_ENABLE_KEY_REPEAT=y

# Memory Configuration (increased for multiple USB devices)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
## Unknown kconfig symbol
# CONFIG_FREERTOS_ASSERT_ON_UNTESTED_FUNCTION=y

# Log Configuration (comprehensive USB debugging)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# USB-specific logging for debugging enumeration issues
## Unknown kconfig symbol
# CONFIG_USB_HOST_LOG_LEVEL_DEBUG=y
# CONFIG_HUB_LOG_LEVEL_DEBUG=y
# CONFIG_ENUM_LOG_LEVEL_DEBUG=y
# CONFIG_USB_HOST_HID_LOG_LEVEL_DEBUG=y

# BLE-specific logging for debugging connection issues
## Unknown kconfig symbol
# CONFIG_BT_LOG_LEVEL_DEBUG=y
# CONFIG_BT_NIMBLE_LOG_LEVEL_DEBUG=y  # Disabled: too verbose for production
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y

# Power Management (optimized for USB stability)
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
## Unknown kconfig symbol
# CONFIG_PM_USE_RTC_TIMER_REF=y

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Compiler Optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y